const { Markup } = require("telegraf");

exports.family_scheme = (bot) => {
  bot.action("apply_ukraine_family_scheme", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Подати заявку на Ukraine Family Scheme</b>
        \nUkraine Family Scheme дозволяє заявникам приєднатися до членів сім'ї або продовжити своє перебування у Великій Британії. Кожен повинен подавати окрему заяву, навіть діти, які подорожують з членом сім'ї.

        Подати заяву можна безкоштовно: https://www.gov.uk/guidance/apply-for-a-ukraine-family-scheme-visa.uk

        Ви зможете жити, працювати і навчатися у Великій Британії, а також мати доступ до соцвиплат (бенефітів).`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "apply_ukraine_family_scheme_continue"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action("apply_ukraine_family_scheme_continue", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Який документ у вас є?</b>
      \nUkraine Family Scheme дозволяє заявникам приєднатися до членів сім'ї або продовжити своє перебування у Великій Британії. Кожен повинен подавати окрему заяву, навіть діти, які подорожують з членом сім'ї.

      Подати заяву можна безкоштовно: https://www.gov.uk/guidance/apply-for-a-ukraine-family-scheme-visa.uk
      
      Ви зможете жити, працювати і навчатися у Великій Британії, а також мати доступ до соцвиплат (бенефітів).`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Дійсний український біометричний паспорт",
            "apply_ukraine_family_scheme_continue_biometric"
          ),
        ],
        [
          Markup.button.callback(
            "Дійсний український небіометричний паспорт",
            "apply_ukraine_family_scheme_continue_non_biometric"
          ),
        ],
        [
          Markup.button.callback(
            "Прострочений український паспорт",
            "apply_ukraine_family_scheme_continue_expired"
          ),
        ],
        [
          Markup.button.callback(
            "Тільки внутрішній український паспорт",
            "apply_ukraine_family_scheme_continue_internal"
          ),
        ],
        [
          Markup.button.callback(
            "Не український паспорт",
            "apply_ukraine_family_scheme_continue_non_ukranian"
          ),
        ],
        [
          Markup.button.callback(
            "Свідоцтво про народження (для дитини до 18 років)",
            "apply_ukraine_family_scheme_continue_birth_certificate"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action(
    [
      "apply_ukraine_family_scheme_continue_birth_certificate",
      "apply_ukraine_family_scheme_continue_non_ukranian",
      "apply_ukraine_family_scheme_continue_internal",
    ],
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Якщо у вас немає дійсного українського закордонного паспорта або простроченого українського закордонного паспорта зі штампом про продовження терміну дії</b>
        \nВам потрібно буде записатися на прийом до візового центру (VAC) і з'явитися на нього. Це також стосується дітей-заявників.

        Під час процесу подання онлайн-заявки вас попросять завантажити копії будь-яких документів, що посвідчують особу, які ви можете мати, а саме
        - українське національне посвідчення особи
        - дійсний паспорт, виданий іншою країною (не Україною)
        - комбінація офіційних документів - наприклад, водійське посвідчення з фотографією та свідоцтво про народження
        - довідку про надзвичайну ситуацію, видану українським органом влади з березня 2022 року

        Надання цих документів не є обов'язковим, але це може допомогти підтримати вашу заяву, якщо ви маєте таку можливість.

        Ви можете завантажити свої документи за допомогою додатку для завантаження документів комерційного партнера Міністерства внутрішніх справ. Це буде або TLS, або VFS, залежно від того, в яку країну ви подаєте заяву. Ви можете завантажити додаток з веб-сайту TLS або VFS під час подання заяви.`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "family_scheme_start_application"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action("apply_ukraine_family_scheme_continue_expired", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Ви не можете використовувати додаток ID Check, якщо термін дії вашого паспорта закінчився, навіть якщо в ньому стоїть офіційна відмітка про продовження, видана українським урядом.</b>
        \nВам не потрібно відвідувати візовий центр для здачі біометричних даних. Замість цього, ви повинні здати біометричні дані протягом 6 місяців після прибуття до Великої Британії.

        Під час подачі заяви ви повинні завантажити копії обох документів:
        
        сторінки з фотографією вашого простроченого паспорта
        сторінки вашого простроченого паспорта з офіційною відміткою про продовження терміну дії
        Ви можете завантажити ці документи за допомогою додатку комерційного партнера для завантаження документів після того, як ви заповнили свою заявку. Це буде або TLS, або VFS, залежно від того, в яку країну ви подаєте заяву. Ви можете завантажити додаток з веб-сайту TLS або VFS під час подання заяви.
        
        Якщо вам потрібна допомога у завантаженні копій документів, ви можете записатися на прийом до візового центру.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "family_scheme_start_application"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action(
    "apply_ukraine_family_scheme_continue_non_biometric",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Якщо ви не можете скористатися додатком ID Check і маєте дійсний український закордонний паспорт</b>
        \nВам не потрібно відвідувати візовий центр для здачі біометричних даних. Замість цього ви повинні надати свої біометричні дані протягом шести місяців після прибуття до Великої Британії.

        Під час подання заяви обов'язково завантажте копію сторінки з фотографією вашого паспорта. Залежно від країни, в якій ви подаєте заяву, ви можете зробити це за допомогою додатку для завантаження документів, наданого комерційним партнером Міністерства внутрішніх справ - TLS або VFS. Завантажте додаток з веб-сайту TLS або VFS, коли ви починаєте подавати заяву.
        
        Якщо вам потрібна допомога у завантаженні документів, ви можете записатися на прийом до візового центру.`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "family_scheme_start_application"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action("apply_ukraine_family_scheme_continue_biometric", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Ви можете підтвердити свою особу за допомогою додатку ID Check</b>

      Під час подання заяви обов'язково завантажте копію сторінки з фотографією вашого паспорта. Залежно від країни, в якій ви подаєте заяву, ви можете зробити це за допомогою додатку для завантаження документів, наданого комерційним партнером Міністерства внутрішніх справ - TLS або VFS. Завантажте додаток з веб-сайту TLS або VFS, коли ви починаєте подавати заяву.
      
      Якщо вам потрібна допомога у завантаженні документів, ви можете записатися на прийом до візового центру.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "apply_ukraine_family_scheme_continue_biometric_phone"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action(
    "apply_ukraine_family_scheme_continue_biometric_phone",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Який у вас телефон?</b>`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "iPhone",
              "apply_ukraine_family_scheme_continue_biometric_phone_iphone"
            ),
          ],
          [
            Markup.button.callback(
              "android",
              "apply_ukraine_family_scheme_continue_biometric_phone_android"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action(
    "apply_ukraine_family_scheme_continue_biometric_phone_iphone",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Додаток "UK Immigration: ID Check" доступний для iPhone 7 і новіших моделей</b>
        \nВам знадобиться iPhone 7, 7 Plus або новіший з iOS 13.2 або новішої версії 

        Щоб дізнатися версію встановленого програмного забезпечення, перейдіть до "Налаштування" - "Загальні", а потім "Про програму"
        
        Для встановлення програми вам знадобиться щонайменше 120 МБ пам'яті, а також підключення до 3G, 4G або WiFi.
        
        Додатку потрібен доступ до камери. Якщо програма не запитує доступ, увімкніть його в налаштуваннях.
        
        Завантажте програму з App Store: https://apps.apple.com/us/app/uk-immigration-id-check/id1499891460`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "У мене є телефон, що відповідає вимогам",
              "apply_ukraine_family_scheme_continue_biometric_phone_eligible"
            ),
          ],
          [
            Markup.button.callback(
              "Мій телефон не відповідає вимогам",
              "apply_ukraine_family_scheme_continue_biometric_phone_not_eligible"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action(
    "apply_ukraine_family_scheme_continue_biometric_phone_android",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Додаток ‘UK Immigration: ID Check’ доступний для Android 6.0 і вище</b>
        \nВам знадобиться Android 6.0 або новішої версії - це можна знайти у ваших налаштуваннях.

        Для встановлення програми на вашому телефоні має бути щонайменше 135 МБ пам'яті, і він має бути підключений до 3G, 4G або WiFi.
        
        Ваш телефон повинен підтримувати NFC, щоб додаток міг відсканувати ваш документ - ви можете знайти це в налаштуваннях - якщо ви можете використовувати свій телефон для безконтактної оплати, це означає, що він має NFC, і ви можете використовувати додаток.
        
        Додатку потрібен доступ до камери. Якщо додаток не запитує доступ, увімкніть його у своїх налаштуваннях.
        
        Завантажте додаток з Google Play Store: https://play.google.com/store/apps/details?id=uk.gov.HomeOffice.ho2&amp;hl=en_GB&amp;gl=US`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "У мене є телефон, що відповідає вимогам",
              "apply_ukraine_family_scheme_continue_biometric_phone_eligible"
            ),
          ],
          [
            Markup.button.callback(
              "Мій телефон не відповідає вимогам",
              "apply_ukraine_family_scheme_continue_biometric_phone_not_eligible"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action(
    "apply_ukraine_family_scheme_continue_biometric_phone_eligible",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Завантажте додаток і переходьте до нього, коли з'явиться відповідний запит під час подачі заяви на візу</b>
        \nПерш ніж користуватися додатком, ви повинні розпочати подачу заявки та створити свій обліковий запис у Візовій та імміграційній службі Великої Британії на сайті GOV.UK.

        Потім вам потрібно буде увійти в систему, щоб почати подачу заяви, вказавши номер свого паспорта, дату народження та одноразовий код безпеки, надісланий на вашу електронну пошту або телефон.
        
        Ви будете використовувати цей обліковий запис для заповнення заяви, перегляду та підтвердження вашого статусу.
        
        Подивіться це відео про те, як користуватися додатком: https://www.youtube.com/watch?v=ryMm0H4jzf8&amp;t=0s`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "family_scheme_start_application"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action(
    "apply_ukraine_family_scheme_continue_biometric_phone_not_eligible",
    async (ctx) => {
      const keyboard = Markup.keyboard([
        ["Я маю дійсний український закордонний паспорт"],
        [
          "У мене прострочений український закордонний паспорт з офіційним штампом продовження",
        ],
        ["У мене немає дійсного українського закордонного паспорта"],
        ["У мене є паспорт, виданий не Україною, а іншою країною"],
      ])
        .resize()
        .oneTime();

      await ctx.replyWithHTML(
        `<b>Ви не зможете користуватися додатком ID Check.</b>
        \n Ваші подальші кроки залежать від документа, який підтверджує вашу особу:`,
        keyboard
      );
    }
  );

  bot.hears(
    [
      "ЯУ мене є паспорт, виданий не Україною, а іншою країною",
      "У мене немає дійсного українського закордонного паспорта",
    ],
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Якщо у вас немає дійсного українського закордонного паспорта або простроченого українського закордонного паспорта зі штампом про продовження терміну дії</b>`,
        Markup.removeKeyboard()
      );

      await ctx.replyWithHTML(
        `Вам потрібно буде записатися на прийом до візового центру (VAC) і з'явитися на нього. Це також стосується дітей-заявників.

        Під час процесу подання онлайн-заявки вас попросять завантажити копії будь-яких документів, що посвідчують особу, які ви можете мати, а саме
        - українське національне посвідчення особи
        - дійсний паспорт, виданий іншою країною (не Україною)
        - комбінація офіційних документів - наприклад, водійське посвідчення з фотографією та свідоцтво про народження
        - довідку про надзвичайну ситуацію, видану українським органом влади з березня 2022 року

        Надання цих документів не є обов'язковим, але це може допомогти підтримати вашу заяву, якщо ви маєте таку можливість.

        Ви можете завантажити свої документи за допомогою додатку для завантаження документів комерційного партнера Міністерства внутрішніх справ. Це буде або TLS, або VFS, залежно від того, в яку країну ви подаєте заяву. Ви можете завантажити додаток з веб-сайту TLS або VFS під час подання заяви.`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "family_scheme_start_application"
            ),
          ],
        ])
      );
    }
  );

  //   expired
  bot.hears(
    "У мене прострочений український закордонний паспорт з офіційним штампом продовження",

    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Ви не можете використовувати додаток ID Check, якщо термін дії вашого паспорта закінчився, навіть якщо в ньому стоїть офіційна відмітка про продовження, видана українським урядом.</b>`,
        Markup.removeKeyboard()
      );

      await ctx.replyWithHTML(
        `Вам не потрібно відвідувати візовий центр для здачі біометричних даних. Замість цього, ви повинні здати біометричні дані протягом 6 місяців після прибуття до Великої Британії.

        Під час подачі заяви ви повинні завантажити копії обох документів:
        
        сторінки з фотографією вашого простроченого паспорта
        сторінки вашого простроченого паспорта з офіційною відміткою про продовження терміну дії
        Ви можете завантажити ці документи за допомогою додатку комерційного партнера для завантаження документів після того, як ви заповнили свою заявку. Це буде або TLS, або VFS, залежно від того, в яку країну ви подаєте заяву. Ви можете завантажити додаток з веб-сайту TLS або VFS під час подання заяви.
        
        Якщо вам потрібна допомога у завантаженні копій документів, ви можете записатися на прийом до візового центру.`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "family_scheme_start_application"
            ),
          ],
        ])
      );
    }
  );

  //   valid
  bot.hears("Я маю дійсний український закордонний паспорт", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Якщо ви не можете скористатися додатком ID Check і маєте дійсний український закордонний паспорт</b>`,
      Markup.removeKeyboard()
    );

    await ctx.replyWithHTML(
      `Вам не потрібно відвідувати візовий центр для здачі біометричних даних. Замість цього ви повинні надати свої біометричні дані протягом шести місяців після прибуття до Великої Британії.

        Під час подання заяви обов'язково завантажте копію сторінки з фотографією вашого паспорта. Залежно від країни, в якій ви подаєте заяву, ви можете зробити це за допомогою додатку для завантаження документів, наданого комерційним партнером Міністерства внутрішніх справ - TLS або VFS. Завантажте додаток з веб-сайту TLS або VFS, коли ви починаєте подавати заяву.
        
        Якщо вам потрібна допомога у завантаженні документів, ви можете записатися на прийом до візового центру.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "family_scheme_start_application"
          ),
        ],
      ])
    );
  });

  bot.action("family_scheme_start_application", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Почніть подавати заяву та створіть свій обліковий запис UK Visas and Immigration онлайн на GOV.UK</b>
        \nПерейдіть на урядовий веб-сайт https://www.gov.uk/guidance/apply-for-a-ukraine-family-scheme-visa.uk, щоб створити обліковий запис UKVI і почати подавати заявку.

        Кожен повинен подати окрему заяву, навіть діти, які подорожують з членом сім'ї.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "apply_ukraine_family_scheme_prepare"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action("apply_ukraine_family_scheme_prepare", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Підготуйте наступну інформацію про себе або про особу, на яку ви подаєте заявку</b>
        \n1. Документ, що посвідчує особу заявника, наприклад, паспорт або, для дітей до 18 років, свідоцтво про народження.
        2. Доказ проживання в Україні станом на 1 січня 2022 року. Це може бути
         - штамп у паспорті, що підтверджує перетин кордону України після 1 січня 2022 року.
        - Виписки з банківського рахунку за листопад або грудень 2021 року.
        - Платіжки за комунальні послуги за листопад або грудень 2021 року.
        - сертифікат про вакцинацію від COVID-19, якщо він отриманий у період з жовтня по грудень 2021 року.
        - будь-які інші офіційні документи з місця проживання заявника.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "Продовжити",
            "apply_ukraine_family_scheme_prepare_family_member"
          ),
        ],
      ])
    );
    ctx.answerCbQuery();
  });

  bot.action(
    "apply_ukraine_family_scheme_prepare_family_member",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Підготуйте наступну інформацію про члена родини</b>
      \n
      1. Скан паспорта (перша сторінка у форматі PDF) або скан водійського посвідчення, дійсного не менше 6 місяців
      2. Який їхній імміграційний статус? Наприклад, громадянин Великобританії, статусо ILR, біженець з правом на захист у Великобританії або статус pre-settled
      3. Ім'я та прізвище члена сім'ї
      4. Громадянство члена вашої сім'ї
      5. Дата народження члена сім'ї
      6. Номер паспорта члена сім'ї
      7. Країна видачі паспорта члена сім'ї
      8. Дата видачі та термін дії паспорта члена сім'ї
      9. Номер телефону члена сім'ї
      10. Адреса електронної пошти члена сім'ї
      11. Чи був член Вашої сім'ї коли-небудь відомий під іншим ім'ям (тобто до шлюбу)
      12. Чи проживає член Вашої родини у Великобританії? Поштовий індекс, назва і номер будинку, назва вулиці, країна у Великобританії
      13. Коли вони почали жити за цією адресою
      14. Стать члена сім'ї в паспорті
      15. Сімейний стан
      16. Чи мав член сім'ї коли-небудь інше громадянство
      17. Чи буде заявник проживати за адресою члена сім'ї
      18. Чи проживають за адресою, де буде проживати заявник, інші особи старше 18 років? Якщо так, надайте їхні дані, включаючи ім'я, дату народження, громадянство, номер паспорта всіх цих осіб.
      19. Докази Ваших стосунків з членом сім'ї`,
        Markup.inlineKeyboard([
          [
            Markup.button.callback(
              "Продовжити",
              "apply_ukraine_family_scheme_upload"
            ),
          ],
        ])
      );
      ctx.answerCbQuery();
    }
  );

  bot.action("apply_ukraine_family_scheme_upload", async (ctx) => {
    const keyboard = Markup.keyboard([
      ["Я використовував додаток ID Check, щоб підтвердити особу заявника"],
      [
        "Надав документи, що посвідчують особу заявника, використовуючи додатки TLS або VFS",
      ],
      ["Мені довелося записатися на прийом до візового центру (ВЦ)"],
    ])
      .resize()
      .oneTime();

    await ctx.replyWithHTML(
      `<b>Після заповнення заявки завантажте докази</b>
        \n
        Після того, як ви дійдете до розділу "Provide evidence", натисніть "Evidence upload" і завантажте свої документи та документи члена сім'ї:

        <b>Ваші наступні кроки залежатимуть від того, як ви надали документи, що посвідчують особу заявника:</b>.`,
      keyboard
    );

    await ctx.telegram.sendPhoto(
      ctx.chat.id,
      "https://thriving-frangollo-33fd04.netlify.app/assets/family_upload.jpeg"
    );

    await ctx.telegram.sendPhoto(
      ctx.chat.id,
      "https://thriving-frangollo-33fd04.netlify.app/assets/family_continue.jpeg",
      "...потім натисніть 'Continue'"
    );

    await ctx.telegram.sendPhoto(
      ctx.chat.id,
      "https://thriving-frangollo-33fd04.netlify.app/assets/family_confirm.jpeg",
      "...потім натисніть 'Confirm and upload'"
    );
  });

  bot.hears(
    [
      "Я використовував додаток ID Check, щоб підтвердити особу заявника",
      "Надав документи, що посвідчують особу заявника, використовуючи додатки TLS або VFS",
    ],

    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Тепер вам потрібно дочекатися рішення про видачу візи</b>`,
        Markup.removeKeyboard()
      );

      await ctx.replyWithHTML(
        `Перевірте електронну пошту, яку ви використовували для подання заяви, на наявність листа <b>Application Update</b>:
        * Якщо там написано: "<b>Your application under the Ukraine Scheme has been successful</b>", це означає, що віза була <b>схвалена</b>, і ви можете вперше подорожувати Великою Британією з цим листом і вашим паспортом (тобто, це ваш лист про дозвіл на в'їзд). У ньому також вказано точний термін дії вашої візи - 3 роки.
        * Якщо є слова "<b>rejected</b>" або "<b>>refused</b>", це означає, що віза не була схвалена.`,
        Markup.inlineKeyboard([
          [Markup.button.callback("Гаразд, це все.", "OK")],
          [
            Markup.button.callback(
              "У мене є ще одне питання, пов'язане з візою",
              "visas"
            ),
          ],
        ])
      );
      await ctx.telegram.sendPhoto(
        ctx.chat.id,
        "https://thriving-frangollo-33fd04.netlify.app/assets/family_wait.jpeg"
      );
    }
  );

  bot.hears(
    "Мені довелося записатися на прийом до візового центру (ВЦ)",
    async (ctx) => {
      await ctx.replyWithHTML(
        `<b>Зверніться до візового центру (VAC), щоб здати біометричні дані</b>`,
        Markup.removeKeyboard()
      );

      await ctx.replyWithHTML(
        `Для того, щоб Home Office розпочав обробку вашої заяви на отримання візи до Великобританії, заявник повинен спочатку відвідати Візовий центр (VAC) і здати свої біометричні дані.`,
        Markup.inlineKeyboard([
          [Markup.button.callback("Продовжити", "book_continue_wait")],
        ])
      );
    }
  );

  bot.action("book_continue_wait", async (ctx) => {
    await ctx.replyWithHTML(
      `<b>Тепер вам потрібно дочекатися рішення про видачу візи</b>
        \nЗаявники, які надали свої біометричні дані через Візовий центр (VAC), отримають візову віньєтку, якщо їхня заявка буде успішною.

        Вони матимуть 90 днів для в'їзду до Великої Британії за цією віньєткою.`,
      Markup.inlineKeyboard([
        [Markup.button.callback("Гаразд, це все.", "OK")],
        [
          Markup.button.callback(
            "У мене є ще одне питання, пов'язане з візою",
            "visas"
          ),
        ],
      ])
    );

    await ctx.telegram.sendPhoto(
      ctx.chat.id,
      "https://thriving-frangollo-33fd04.netlify.app/assets/family_book_wait.jpeg"
    );
  });
};
