const { Markup } = require("telegraf");

exports.faq = (bot) => {
  const faq_1 = Markup.keyboard([
    [
      "Скільки часу я маю для в'їзду до Великої Британії за візою Homes for Ukraine або Ukraine Family Scheme?",
    ],
    ["Чи можу я залишити свого спонсора до закінчення 6-місячного періоду?"],
    [
      "Чи може спонсор стягувати орендну плату або просити гостей оплачувати комунальні послуги?",
    ],
    ["Скільки складає thank you виплата спонсорам?"],
    [
      "Чи можу я спонсорувати члена моєї української сім'ї по Homes for Ukraine?",
    ],
    ["Коли закінчується термін дії схеми Homes for Ukraine?"],
    ["більше запитань (2/3) ➡️"],
  ])
    .resize()
    .oneTime();

  const faq_2 = Markup.keyboard([
    ["Які вимоги до житла спонсора за схемою Homes for Ukraine?"],
    ["Чи отримують гості з візами Ukraine Scheme якісь виплати чи пільги?"],
    ["Що робити, якщо спонсорство припиняється?"],
    ["Які кроки для зміни спонсора?"],
    ["Як здійснюється перевірка спонсорів DBS?"],
    [
      'Чи можуть люди з "українськими" візами привозити з собою домашніх тварин?',
    ],
    ["більше запитань (3/3) ➡️"],
    ["⬅️ повернутись (1/3)"],
  ])
    .resize()
    .oneTime();

  const faq_3 = Markup.keyboard([
    [
      "Чи можуть українці у Великобританії, які перебувають на Family Scheme або Ukraine Extension Scheme, перейти на Homes for Ukraine?",
    ],
    [
      "Чи мають право на thank you виплату ті, хто розміщує людей за сімейною програмою?",
    ],
    ["⬅️ повернутись (2/3)"],
  ])
    .resize()
    .oneTime();

  bot.action("faq", async (ctx) => {
    await ctx.replyWithHTML(`<b>Популярні питання про візи (1/3)</b>`, faq_1);
    ctx.answerCbQuery();
  });

  bot.hears("⬅️ повернутись (1/3)", async (ctx) => {
    await ctx.replyWithHTML(`<b>Популярні питання про візи (1/3)</b>`, faq_1);
  });

  bot.hears("більше запитань (2/3) ➡️", async (ctx) => {
    await ctx.replyWithHTML(`<b>Популярні питання про візи (2/3)</b>`, faq_2);
  });

  bot.hears("⬅️ повернутись (2/3)", async (ctx) => {
    await ctx.replyWithHTML(`<b>Популярні питання про візи (2/3)</b>`, faq_2);
  });

  bot.hears("більше запитань (3/3) ➡️", async (ctx) => {
    await ctx.replyWithHTML(`<b>Популярні питання про візи (3/3)</b>`, faq_3);
  });

  const answer_keyboard = Markup.inlineKeyboard([
    [Markup.button.callback("Гаразд, це все.", "OK")],
    [
      Markup.button.callback(
        "У мене є ще одне питання, пов'язане з візою",
        "visas"
      ),
    ],
  ]);

  //  answers
  // 1
  bot.hears(
    "Скільки часу я маю для в'їзду до Великої Британії за візою Homes for Ukraine або Ukraine Family Scheme?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Лист про дозвіл на в'їзд не обмежений у часі: https://bit.ly/42EOMFV. 

      Термін дії паперової візи-віньєтки обмежений 90 днями.`,
        answer_keyboard
      );
    }
  );

  // 2
  bot.hears(
    "Чи можу я залишити свого спонсора до закінчення 6-місячного періоду?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Так, ти можеш залишити свого спонсора до закінчення 6-місячного періоду, ви не зобов'язані залишатися з ним протягом усього періоду. 

        Однак, перед тим, як прийняти таке рішення, важливо розглянути варіанти житла. Ринок оренди у Великій Британії може бути досить конкурентним, і без постійної роботи та стабільного доходу знайти орендуу може бути складно. Тому, як правило, не рекомендується залишати свого спонсора, якщо тільки ви не відчуваєте значного дискомфорту або жорстокого поводження.`,
        answer_keyboard
      );
    }
  );

  // 3
  bot.hears(
    "Чи може спонсор стягувати орендну плату або просити гостей оплачувати комунальні послуги?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `1. <b>Спонсору заборонено стягувати орендну плату.</b> Для покриття витрат, пов'язаних з наданням допомоги, уряд Великої Британії пропонує спонсорам виплату "thank you" у розмірі 350 фунтів на місяць на домогосподарство (збільшується до 500 фунтів на місяць для гостей, які перебувають у Великій Британії більше 12 місяців).
        2. <b>Спонсор може попросити гостей сплатити розумний і пропорційний внесок (відповідно до використання) за воду, газ та електроенергію</b>, спожиті або поставлені в житло або на будь-які спільні об'єкти. 
        3. У випадку автономного проживання, спонсор повинен узгодити з вами (своїм гостем), хто буде сплачувати комунальний податок.`,
        answer_keyboard
      );
    }
  );

  // 4
  bot.hears("Скільки складає thank you виплата спонсорам?", async (ctx) => {
    await ctx.replyWithHTML(
      `Щоб покрити витрати, пов'язані з наданням допомоги, уряд Великобританії пропонує спонсорам виплату "thank you" у розмірі 350 фунтів на місяць на кожне домогосподарство. Це не залежить від кількості прийнятих гостей.

        Виплата thank you збільшується до 500 фунтів на місяць для гостей, які перебувають у Великій Британії більше 12 місяців.`,
      answer_keyboard
    );
  });

  // 5
  bot.hears(
    "Чи можу я спонсорувати члена моєї української сім'ї по Homes for Ukraine?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Так, ви можете спонсорувати родичів за схемою Homes for Ukraine.`,
        answer_keyboard
      );
    }
  );

  // 6
  bot.hears(
    "Коли закінчується термін дії схеми Homes for Ukraine?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Наразі дата завершення цієї схеми не визначена. Слідкуйте за оновленнями на сайті gov.uk.`,
        answer_keyboard
      );
    }
  );

  // 7
  bot.hears("Скільки коштує віза Homes for Ukraine?", async (ctx) => {
    await ctx.replyWithHTML(
      `Віза безкоштовна. Спонсор не має права стягувати з гостей плату за спонсорство, а також не має права брати орендну плату.

        Спонсор може попросити гостей сплатити розумний і пропорційний внесок (відповідно до використання) за воду, газ та електроенергію, спожиті або поставлені в житло або в будь-які загальні приміщення. 
        
        У випадку автономного проживання, спонсор повинен узгодити з вами (своїм гостем), хто буде сплачувати комунальний податок.
        
        Той, хто пропонує спонсорство в обмін на гроші або роботу, є шахраєм.`,
      answer_keyboard
    );
  });

  // 8
  bot.hears(
    "Які вимоги до житла спонсора за схемою Homes for Ukraine?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Відповідно до схеми Homes for Ukraine, основною вимогою є надання спонсором стабільного житла принаймні на 6 місяців. Це може бути:

      - Власний будинок спонсора, де він проживає в даний час
      - Будинок, що належить спонсору, але не зайнятий ним
      - Орендоване житло, якщо орендодавець дозволяє додаткових гостей (необхідне письмове підтвердження)
      
      Крім того, житло повинно мати достатньо місця для всіх поточних мешканців та нових гостей, не створюючи при цьому <a href="https://england.shelter.org.uk/professional_resources/legal/housing_conditions/overcrowding">перенаселеності</a>. 
      
      Крім того, уряд Великої Британії вимагає від житла:
      - утримуватися в чистоті та належному стані
      - мати достатній простір на кухні та у ванній кімнаті
      - мати доступ до питної води
      - на кожному поверсі житла був справний детектор диму та інші заходи пожежної безпеки, що відповідають вимогам будівлі, наприклад, протипожежні двері або шляхи евакуації, якщо це необхідно;
      - мати справний детектор чадного газу в кожній кімнаті, де є прилад, що працює на твердому паливі (наприклад, вугільний камін, дров'яна піч);
      - мати достатнє опалення для підтримання комфортної температури в помешканні;
      - мати безпечні газові прилади, фітинги та димоходи, а також пройти перевірку газової безпеки протягом останнього року;
      - мати безпечну та працюючу електрику;
      - бути майже повністю вільними від вогкості та плісняви;
      - мати двері та вікна на рівні входу, які належним чином замикаються;
      - бути зручним і безпечним для пересування, без надмірно крутих сходів, які можуть завдати шкоди.`,
        answer_keyboard
      );
    }
  );

  // 9
  bot.hears(
    "Чи отримують гості з візами Ukraine Scheme якісь виплати чи пільги?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Гості за програмою Homes for Ukraine мають право на одноразову проміжну виплату у розмірі 200 фунтів для покриття витрат на проживання. Ця виплата надається місцевою радою після підтвердження прибуття гостя до будинку спонсора. Однак ті, хто перебуває на програмах Ukraine Family Scheme або Ukraine Extension Scheme, не мають права на цю виплату.

        Крім того, особи з "українськими" візами  можуть претендувати на бенефіти. Для отримання додаткової інформації, будь ласка, перегляньте вебінар: https://ua.opora.uk/benefits.`,
        answer_keyboard
      );
    }
  );

  // 10
  bot.hears("Що робити, якщо спонсорство припиняється?", async (ctx) => {
    await ctx.replyWithHTML(
      `У випадку, якщо спонсорство розривається, дуже важливо, щоб як спонсори, так і гості вжили негайних заходів. Спонсори повинні негайно повідомити місцеву раду (консіл) про ситуацію, що склалася. 

        Гості, особливо ті, що знаходяться під загрозою бездомності, також повинні повідомити консіл. Для отримання додаткової інформації див. цю публікацію: https://t.me/opora_housing/16584
        
        Крім того, ми наполегливо рекомендуємо гостям якомога швидше розпочати пошук приватного житла для оренди. Наш гід з оренди житла може надати цінну допомогу в цьому процесі: https://ua.opora.uk/life-in-the-uk-guides-ua/rent-in-the-uk-ua`,
      answer_keyboard
    );
  });

  // 11
  bot.hears("Які кроки для зміни спонсора?", async (ctx) => {
    await ctx.replyWithHTML(
      `Дотримуйтесь покрокової інструкції, наведеної в цій публікації: https://bit.ly/3wzJkoB`,
      answer_keyboard
    );
  });

  // 12
  bot.hears("Як здійснюється перевірка спонсорів DBS?", async (ctx) => {
    await ctx.replyWithHTML(
      `Рада та/або зареєстрований орган надасть спонсору (та будь-яким повнолітнім членам домогосподарства спонсора, яким виповнилося 16 років) відповідну форму, базову або розширену, яку особа повинна буде заповнити. Рада повинна буде перевірити особу кожного заявника і, у випадку розширеної перевірки, поставити свій підпис на анкеті.

      Перевірка DBS завершується до або якомога швидше після прибуття гостя. Схвалення візи не залежить від завершення перевірки DBS. Якщо за результатами перевірки DBS виникають проблеми, гості відселяються місцевою владою. У разі повторного заселення, ради повинні будуть провести відповідну перевірку DBS та перевірку житла заздалегідь, до того, як заселитися.`,
      answer_keyboard
    );
  });

  // 13
  bot.hears(
    'Чи можуть люди з "українськими" візами привозити з собою домашніх тварин?',
    async (ctx) => {
      await ctx.replyWithHTML(
        `Так, особи, які мають "українську" візу, можуть привозити своїх домашніх тварин до Великобританії. Для цього дотримуйтесь офіційних урядових інструкцій, наведених тут: https://www.gov.uk/guidance/bringing-your-pet-to-the-uk-from-ukraine.
        
        Обов'язково заздалегідь обговоріть і підтвердіть зі своїм спонсором, що ви візьмете з собою домашнього улюбленця.`,
        answer_keyboard
      );
    }
  );

  // 14
  bot.hears(
    "Чи можуть українці у Великобританії, які перебувають на Family Scheme або Ukraine Extension Scheme, перейти на Homes for Ukraine?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Ні. Перехід між українськими візовими схемами України неможливий.`,
        answer_keyboard
      );
    }
  );

  // 15
  bot.hears(
    "Чи мають право на thank you виплату ті, хто розміщує людей за сімейною програмою?",
    async (ctx) => {
      await ctx.replyWithHTML(
        `Платежі "thank you" доступні лише для спонсорів по Homes for Ukraine.`,
        answer_keyboard
      );
    }
  );
};
